espressif/esp-iot-solution/examples/hmi/perf_benchmark/sdkconfig.ci.perf_esp32
CONFIG_IDF_TARGET="esp32"
# For IDF 5.0
CONFIG_ESP_TASK_WDT_EN=n

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_LV_MEM_BUF_MAX_NUM=10
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
